# 파일 읽기
- csv파일읽기
- 탭으로 구분된 파일읽기

## CSV파일 읽기

##### Factor Object로 읽지 않기

In [16]:
readcsv_defa <- read.csv("data/readcsv_simple.csv", header= TRUE)
#default 옵션에서는 문자를 factor로 읽는다. 

str(readcsv_defa)

'data.frame':	32 obs. of  12 variables:
 $ X   : Factor w/ 32 levels "AMC Javelin",..: 18 19 5 13 14 31 7 21 20 22 ...
 $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl : int  6 6 4 6 8 6 8 4 4 6 ...
 $ disp: num  160 160 108 258 360 ...
 $ hp  : int  110 110 93 110 175 105 245 62 95 123 ...
 $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec: num  16.5 17 18.6 19.4 17 ...
 $ vs  : int  0 0 1 1 0 1 0 1 1 1 ...
 $ am  : int  1 1 1 0 0 0 0 0 0 0 ...
 $ gear: int  4 4 4 3 3 3 3 4 4 4 ...
 $ carb: int  4 4 1 1 2 1 4 2 2 4 ...

In [18]:
#Factor Object로 읽지 않기
readcsv_fa <- read.csv("data/readcsv_simple.csv", header= TRUE, stringsAsFactors = FALSE)
str(readcsv_fa) 
# character로 나옴.

# factor로 하게 되면, 전처리가 매우 어려움. - 사칙연산이 안되기 때문!
# 파일 읽는 속도가 올라감

'data.frame':	32 obs. of  12 variables:
 $ X   : chr  "Mazda RX4" "Mazda RX4 Wag" "Datsun 710" "Hornet 4 Drive" ...
 $ mpg : num  21 21 22.8 21.4 18.7 18.1 14.3 24.4 22.8 19.2 ...
 $ cyl : int  6 6 4 6 8 6 8 4 4 6 ...
 $ disp: num  160 160 108 258 360 ...
 $ hp  : int  110 110 93 110 175 105 245 62 95 123 ...
 $ drat: num  3.9 3.9 3.85 3.08 3.15 2.76 3.21 3.69 3.92 3.92 ...
 $ wt  : num  2.62 2.88 2.32 3.21 3.44 ...
 $ qsec: num  16.5 17 18.6 19.4 17 ...
 $ vs  : int  0 0 1 1 0 1 0 1 1 1 ...
 $ am  : int  1 1 1 0 0 0 0 0 0 0 ...
 $ gear: int  4 4 4 3 3 3 3 4 4 4 ...
 $ carb: int  4 4 1 1 2 1 4 2 2 4 ...

##### 특정 값을 결측으로 처리하기

In [13]:
numchar <- read.csv("data/numChar.csv")
str(numchar)   #score에 문자 NIL 이 있음, 이 값을 NA값으로 변환하여 읽고자 함.

'data.frame':	3 obs. of  3 variables:
 $ id   : int  1 2 3
 $ name : Factor w/ 3 levels "Mr. Baz ","Mr. Foo ",..: 2 3 1
 $ score: Factor w/ 3 levels "92","95","NIL": 2 3 1

In [15]:
numchar <- read.csv("data/numChar.csv", na.strings =c("NIL"))
str(numchar)  

# NIL값이 NA로 나옴
# SCORE의 속성이 int로 바뀌어, 계산이 가능하게 됨.

'data.frame':	3 obs. of  3 variables:
 $ id   : int  1 2 3
 $ name : Factor w/ 3 levels "Mr. Baz ","Mr. Foo ",..: 2 3 1
 $ score: int  95 NA 92

practice

In [21]:
numchar2 <- read.csv("data/numChar2.csv")
numchar2

   id name     score
1  1  Mr. o    95
2  2  Ms. Bar  NN
3  3  Mr. Baz  92
4  1  Mr. Ho   95
5  2  Ms. Bar  CC
6  3  Mr. Baz  92
7  1  Mr. Foo  95
8  2  Ms. Ba   NIL
9  3  Mr. Bab  92
10 1  Mr. Foo  95
11 2  Ms. Bar  NIL
12 3  Mr. Baz  92
13 1  Mr. Foo  95
14 2  Ms. Bar  NIL
15 3  Mr. Ba   92

In [23]:
numchar2 <- read.csv("data/numChar2.csv", na.string=c("NIL","NN","CC"))
numchar2

   id name     score
1  1  Mr. o    95
2  2  Ms. Bar  NA
3  3  Mr. Baz  92
4  1  Mr. Ho   95
5  2  Ms. Bar  NA
6  3  Mr. Baz  92
7  1  Mr. Foo  95
8  2  Ms. Ba   NA
9  3  Mr. Bab  92
10 1  Mr. Foo  95
11 2  Ms. Bar  NA
12 3  Mr. Baz  92
13 1  Mr. Foo  95
14 2  Ms. Bar  NA
15 3  Mr. Ba   92

##### 글깨짐 처리하기
- encoding = "UTF-8"을 추가한다.

In [32]:
corre <- read.csv("data/correlationx1x2x3-raw.csv", header = TRUE)
corre

   x1 x2 x3
1  30  5 23
2  33 10 20
3  61 13 33
4  40 12 21
5  30  6 27
6  33  5 22
7  25  9 19
8  23  5  9
9  23  7 23
10 23  6 23
11 20  9 23
12 33 14 20
13 21  8 33
14 27  7 21
15 22  9 27
16 19  9 22
17  9 20 19
18 12  7  9
19 12  8 12

In [33]:
corre2 <- read.csv("data/correlationx1x2x3-raw.csv", header = TRUE, encoding="UTF-8")
corre2

   x1 x2 x3
1  30  5 23
2  33 10 20
3  61 13 33
4  40 12 21
5  30  6 27
6  33  5 22
7  25  9 19
8  23  5  9
9  23  7 23
10 23  6 23
11 20  9 23
12 33 14 20
13 21  8 33
14 27  7 21
15 22  9 27
16 19  9 22
17  9 20 19
18 12  7  9
19 12  8 12

#####  금액이나 이름등 중간에 ","이 포함된 CSV파일 읽기
- 금액이나, 회사명 등을 표시할 때, 쉼표(" , ")가 값의 중간에 포함되는 경우, 이름 또는 숫자와 같은 데이터 항목 내에 ','포함할 수 있다.

In [37]:
read.csv("data/quote.csv",quote="'", header=TRUE)

# quote="'" -> 작은 따옴표를 하나로 보아라

  name           price   rate doller customer.class
1 Hong, joo       200000 1.14 175    A
2 Kim, Seondal   1000000 1.16 862    C
3 Lee, Soonsin   1000000 1.14 877    A
4 Hong, Seungjae  300000 1.15 261    B

#####  컬럼별로 데이터타입을 지정하여 읽기
- 데이터 분석을 할 때 용이함.

In [53]:
col <- read.csv("data/quote.csv",quote="'", header=TRUE,
        colClasses=c("character","numeric","numeric","factor"))
str(col)

'data.frame':	4 obs. of  5 variables:
 $ name          : chr  "Hong, joo" "Kim, Seondal" "Lee, Soonsin" "Hong, Seungjae"
 $ price         : num  2e+05 1e+06 1e+06 3e+05
 $ rate          : num  1.14 1.16 1.14 1.15
 $ doller        : Factor w/ 4 levels "175","261","862",..: 1 3 4 2
 $ customer.class: chr  "A" "C" "A" "B"

##### 숫자로 된 데이터를 factor로 읽어오기

In [72]:
col <- read.csv("data/0_data.frame2_death.csv", header = TRUE, fileEncoding = "EUC-KR", colClasses=rep("factor",18))

In [74]:
str(col)  #factor로 읽어옴

'data.frame':	7651 obs. of  18 variables:
 $ No.               : Factor w/ 7651 levels "1","10","100",..: 1 1112 2223 3334 4445 5556 6667 7430 7541 2 ...
 $ year              : Factor w/ 2 levels "2012","2013": 1 1 1 1 1 1 1 1 1 1 ...
 $ 발생년월일        : Factor w/ 5984 levels "2012010101","2012010102",..: 884 1986 28 346 709 977 1531 2091 2115 2392 ...
 $ 발생시간          : Factor w/ 60 levels "0","1","10","11",..: 30 14 46 3 3 11 4 14 30 17 ...
 $ 사망자수          : Factor w/ 5 levels "1","2","3","4",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ 부상자수          : Factor w/ 28 levels "1","10","100",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ 중상자수          : Factor w/ 18 levels "0","1","10","11",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ 경상자수          : Factor w/ 20 levels "0","1","10","11",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ 부상신고자수      : Factor w/ 9 levels "0","1","2","3",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ 발생지시군구      : Factor w/ 231 levels "1101","1102",..: 1 1 7 7 7 7 7 7 7 7 ...
 $ 발생지시도코드    : Factor w/ 17 levels "1100","1200",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ 사고유형대분류    : Factor w/ 4 levels "1","2","3","4": 1 1 1 2 3 1 2 2 2 1 ...
 $ 사고유형중분류    : Factor w/ 17 levels "11","12","13",..: 1 5 1 7 10 5 7 6 7 5 ...
 $ 사고유형          : Factor w/ 19 levels "1","2","21","22",..: 1 16 1 4 10 16 4 3 4 16 ...
 $ 법규위반1단대분류 : Factor w/ 2 levels "1","2": 1 1 1 1 1 1 1 1 1 1 ...
 $ 법규위반1당중분류 : Factor w/ 16 levels "10","12","13",..: 2 2 2 2 2 2 2 13 5 2 ...
 $ 도로형태대분류코드: Factor w/ 6 levels "1","2","3","4",..: 2 1 1 1 6 1 2 2 1 1 ...
 $ 도로형태          : Factor w/ 11 levels "1","10","2","3",..: 7 6 6 6 11 6 7 7 3 6 ...

##### 상위 몇 개 라인을 제외하고 읽고, 메타 데이터 입력하기

In [67]:
w_ich <- read.csv("data/기상이천시강수량_20100101-20151231.csv",skip=6, fileEncoding = "EUC-KR")
str(w_ich)

'data.frame':	2191 obs. of  3 variables:
 $ 날짜      : Factor w/ 2191 levels "2010/01/01","2010/01/02",..: 1 2 3 4 5 6 7 8 9 10 ...
 $ 지점      : int  203 203 203 203 203 203 203 203 203 203 ...
 $ 강수량.mm.: num  NA 0.8 NA 17.8 0 NA NA NA 0.2 NA ...

In [68]:
w_ich <- structure(w_ich, "Term"="2010.1.1 ~ 2015.12.31", "district" = "Icheon", "description" = "일단위측청", "전영승"="최화령")

In [69]:
str(w_ich)

'data.frame':	2191 obs. of  3 variables:
 $ 날짜      : Factor w/ 2191 levels "2010/01/01","2010/01/02",..: 1 2 3 4 5 6 7 8 9 10 ...
 $ 지점      : int  203 203 203 203 203 203 203 203 203 203 ...
 $ 강수량.mm.: num  NA 0.8 NA 17.8 0 NA NA NA 0.2 NA ...
 - attr(*, "Term")= chr "2010.1.1 ~ 2015.12.31"
 - attr(*, "district")= chr "Icheon"
 - attr(*, "description")= chr "일단위측청"
 - attr(*, "전영승")= chr "최화령"

## 탭으로 구분된 파일 읽기

In [49]:
??read

In [85]:
ar <- read.csv("data/tab.csv", sep="\t")
head(ar)

  X1.1....2.98....4.05....3.72....4.17....4.28....3.94..301.30
1  1 1    2.44    3.98    3.46    4.14    3.85    3.87  360.41
2  1 1    3.03    3.42    3.04    2.67    2.94    2.94  330.74
3  1 1    3.15    4.35    5.00    4.65    4.69    4.75  317.40
4  1 1    2.06    3.48    2.81    3.67    3.78    3.60  350.98
5  2 1    2.39    3.67    3.88    4.23    4.12    3.83  333.04
6  1 1    2.98    4.13    4.18    4.00    4.61    4.36  347.53

In [91]:
ar<- read.delim("data/tab.csv", sep=" ")
str(ar)

'data.frame':	142 obs. of  29 variables:
 $ X      : logi  NA NA NA NA NA NA ...
 $ X1     : int  1 1 1 1 2 1 1 2 1 1 ...
 $ X1.1   : int  1 1 1 1 1 1 1 1 1 1 ...
 $ X.1    : logi  NA NA NA NA NA NA ...
 $ X.2    : logi  NA NA NA NA NA NA ...
 $ X.3    : logi  NA NA NA NA NA NA ...
 $ X2.98  : num  2.44 3.03 3.15 2.06 2.39 2.98 2.73 2.77 2.61 2.01 ...
 $ X.4    : logi  NA NA NA NA NA NA ...
 $ X.5    : logi  NA NA NA NA NA NA ...
 $ X.6    : logi  NA NA NA NA NA NA ...
 $ X4.05  : num  3.98 3.42 4.35 3.48 3.67 4.13 3.75 3.98 3.45 4.33 ...
 $ X.7    : logi  NA NA NA NA NA NA ...
 $ X.8    : logi  NA NA NA NA NA NA ...
 $ X.9    : logi  NA NA NA NA NA NA ...
 $ X3.72  : num  3.46 3.04 5 2.81 3.88 4.18 2.75 3.19 2.12 3 ...
 $ X.10   : logi  NA NA NA NA NA NA ...
 $ X.11   : logi  NA NA NA NA NA NA ...
 $ X.12   : logi  NA NA NA NA NA NA ...
 $ X4.17  : num  4.14 2.67 4.65 3.67 4.23 4 3.54 4 2.54 4 ...
 $ X.13   : logi  NA NA NA NA NA NA ...
 $ X.14   : logi  NA NA NA NA NA NA ...
 $ X.15   : logi  NA NA NA NA NA NA ...
 $ X4.28  : num  3.85 2.94 4.69 3.78 4.12 4.61 4.16 3.91 3.85 4.21 ...
 $ X.16   : logi  NA NA NA NA NA NA ...
 $ X.17   : logi  NA NA NA NA NA NA ...
 $ X.18   : logi  NA NA NA NA NA NA ...
 $ X3.94  : num  3.87 2.94 4.75 3.6 3.83 4.36 3.33 3.61 3.4 4.2 ...
 $ X.19   : logi  NA NA NA NA NA NA ...
 $ X301.30: num  360 331 317 351 333 ...

In [8]:
wifi<- read.delim("data/seoul_wifi2.csv", header = T, sep=" ", fileEncoding = "EUC-KR")
str(wifi)

'data.frame':	3896 obs. of  1 variable:
 $ 구명.유형.지역명.설치위치.X좌표..설치위치.Y좌표..설치기관.회사.: Factor w/ 3586 levels "","\t123.977873\t37.4746893\t관악구",..: 275 276 277 278 279 280 281 282 283 284 ...

헤드가 있고, 속성명이 있는 경우

In [13]:
id <- read.delim("data/Id.txt", sep= "\t", header = T, fileEncoding = "EUC-KR")
id

  Id_num Price
1 Aa     36.9
2 Bb      4.5
3 Cc      8.9

In [19]:
as <- read.table("data/Id.txt", header =T, fileEncoding = "EUC-KR")
names(as) <- c("id","price")
as

  id price
1 Aa 36.9
2 Bb  4.5
3 Cc  8.9

### 열의 모양이 불일치 하는 Text파일 읽기

In [28]:
qar <- read.table("data/question1.txt", fileEncoding = "EUC-KR")

#  raw data에 '#'기호는 주석(설명문)으로 인식하여 자동으로 읽지 않는다.

names(qar) <- c("첫월급", "성", "근무개월", "현재월급", "교육연수")

In [29]:
head(qar)

  첫월급  성 근무개월 현재월급 교육연수
1  840000 0  81       1768800  16
2 2400000 0  73       4554000  16
3 1020000 0  83       2415600  15
4  870000 0  93       2112000  16
5 1740000 0  83       3118500  19
6 1299600 0  80       2997500  18

#### 맨 앞줄 몇 라인 건너뛰고 읽기
- 헤더영역 이라고도 표현되고 헤더부분은 파일 설명 문구로 상단에 포함되는 겨우가 대부분

In [47]:
head <- read.table("data/header.txt", comment.char="#", quote="'", sep=",", header= T, stringsAsFactors=FALSE,
                   colClasses=c("character","numeric","numeric","numeric","factor"))


# stringsAsFactors=FALSE - >문자 타입을 factor구조로 변환여부지정, 예stringAsFactors=FALSE는 문자를 FActors로 읽지 않겠다
# colClasses -> 각 컬럼의 타입 정해주기

In [40]:
str(head)
head(head)

'data.frame':	4 obs. of  5 variables:
 $ customer.name : chr  "Hong, Gildong" "Kim, Seondal" "Lee, Soonsin" "Kim, Seungjae"
 $ price         : num  2e+05 1e+06 1e+06 3e+05
 $ exchange.rate : num  1.14 1.16 1.14 1.15
 $ doller        : num  175 862 877 261
 $ customer.class: Factor w/ 4 levels "A","B","C","VIP": 1 3 4 2

  customer.name price exchange.rate doller customer.class
1 Hong, Gildong 2e+05 1.14          175    A
2 Kim, Seondal  1e+06 1.16          862    C
3 Lee, Soonsin  1e+06 1.14          877    VIP
4 Kim, Seungjae 3e+05 1.15          261    B

In [44]:
head_str <- structure(head,"Owner"="Hong, Gildong", "MakeDate"= "2012-05-15")
str(head_str)

'data.frame':	4 obs. of  5 variables:
 $ customer.name : chr  "Hong, Gildong" "Kim, Seondal" "Lee, Soonsin" "Kim, Seungjae"
 $ price         : num  2e+05 1e+06 1e+06 3e+05
 $ exchange.rate : num  1.14 1.16 1.14 1.15
 $ doller        : num  175 862 877 261
 $ customer.class: Factor w/ 4 levels "A","B","C","VIP": 1 3 4 2
 - attr(*, "Owner")= chr "Hong, Gildong"
 - attr(*, "MakeDate")= chr "2012-05-15"